Revit 2024 API
ParameterTypeId.ForegroundAnyPatternIdParam Property
 "Foreground Fill Pattern"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ForegroundAnyPatternIdParam { get; }
Visual Basic
Public Shared ReadOnly Property ForegroundAnyPatternIdParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ForegroundAnyPatternIdParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace